In [9]:
import pandas as pd
import numpy as np

In [10]:
df1 = pd.read_csv('../csv-data/concat_1.csv') #상대경로!

In [ ]:
# c:/temp/csv-data/concat_1.csv => 절대경로

In [11]:
df2 = pd.read_csv('../csv-data/concat_2.csv')

In [12]:
df3 = pd.read_csv('../csv-data/concat_3.csv')

In [13]:
df11 = pd.read_csv('../csv-data/concat_11.csv')

In [14]:
df22 = pd.read_csv('../csv-data/concat_22.csv')

In [15]:
df33 = pd.read_csv('../csv-data/concat_33.csv')

In [18]:
row_concat = pd.concat([df1, df2, df3], ignore_index=True)
row_concat

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [19]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [20]:
df2

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [21]:
df3

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [22]:
row_concat2 = pd.concat([df11, df22, df33],ignore_index=True)

In [23]:
row_concat2 #outer join, pd.concat(join='outer')

      A    B    C    D    E    F    G    H
0    a0   b0   c0   d0  NaN  NaN  NaN  NaN
1    a1   b1   c1   d1  NaN  NaN  NaN  NaN
2    a2   b2   c2   d2  NaN  NaN  NaN  NaN
3    a3   b3   c3   d3  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   a4   b4   c4   d4
5   NaN  NaN  NaN  NaN   a5   b5   c5   d5
6   NaN  NaN  NaN  NaN   a6   b6   c6   d6
7   NaN  NaN  NaN  NaN   a7   b7   c7   d7
8    a1  NaN   b8  NaN  NaN   c8  NaN   d8
9    a3  NaN   b9  NaN  NaN   c9  NaN   d9
10  a10  NaN  b10  NaN  NaN  c10  NaN  d10
11  a11  NaN  b11  NaN  NaN  c11  NaN  d11

In [27]:
row_concat2.to_csv('row_concat2.csv')

In [28]:
!ls #window : !dir

colab_test_1.ipynb    dataframe_test1.ipynb visualization1.ipynb
colab_test_2.ipynb    dataframe_test2.ipynb
csv-data              row_concat2.csv

In [24]:
df11

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [25]:
df22

    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [26]:
df33

     A    C    F    H
0   a1   b8   c8   d8
1   a3   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [29]:
row_concat3 = pd.read_csv('row_concat2.csv')
row_concat3

    Unnamed: 0    A    B    C    D    E    F    G    H
0            0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1            1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2            2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3            3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
4            4  NaN  NaN  NaN  NaN   a4   b4   c4   d4
5            5  NaN  NaN  NaN  NaN   a5   b5   c5   d5
6            6  NaN  NaN  NaN  NaN   a6   b6   c6   d6
7            7  NaN  NaN  NaN  NaN   a7   b7   c7   d7
8            8   a1  NaN   b8  NaN  NaN   c8  NaN   d8
9            9   a3  NaN   b9  NaN  NaN   c9  NaN   d9
10          10  a10  NaN  b10  NaN  NaN  c10  NaN  d10
11          11  a11  NaN  b11  NaN  NaN  c11  NaN  d11

In [30]:
row_concat3.drop(columns=['Unnamed: 0'], inplace=True)

In [31]:
row_concat3

      A    B    C    D    E    F    G    H
0    a0   b0   c0   d0  NaN  NaN  NaN  NaN
1    a1   b1   c1   d1  NaN  NaN  NaN  NaN
2    a2   b2   c2   d2  NaN  NaN  NaN  NaN
3    a3   b3   c3   d3  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   a4   b4   c4   d4
5   NaN  NaN  NaN  NaN   a5   b5   c5   d5
6   NaN  NaN  NaN  NaN   a6   b6   c6   d6
7   NaN  NaN  NaN  NaN   a7   b7   c7   d7
8    a1  NaN   b8  NaN  NaN   c8  NaN   d8
9    a3  NaN   b9  NaN  NaN   c9  NaN   d9
10  a10  NaN  b10  NaN  NaN  c10  NaN  d10
11  a11  NaN  b11  NaN  NaN  c11  NaN  d11

In [33]:
row_append = df1.append(df2, ignore_index=True)
row_append

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7

In [35]:
# row_append.iloc[8] = ['a8','b8','c8','d8']
# row_append

In [38]:
new_dic = {'A': 'a8',
           'B': 'b8', 
           'C': 'c8',
           'D': 'd8',
          }

In [39]:
row_append2 = row_append.append(new_dic, ignore_index=True)
row_append2

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7
8  a8  b8  c8  d8

In [45]:
row_concat3 = pd.concat([df11, df22, df33], 
                        join = 'inner', 
                        ignore_index = True)
# 공통적으로 들어있는 항목들에 대해서면 합하라는 의미!
row_concat3[:5]

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [47]:
row_concat31 = pd.concat([df11, df22], 
                        join = 'inner', 
                        ignore_index = True)
row_concat31[:3]

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [48]:
row_concat32 = pd.concat([df33, df22], 
                        join = 'inner', 
                        ignore_index = True)
row_concat32[:3]

     F    H
0   c8   d8
1   c9   d9
2  c10  d10

In [49]:
row_concat33 = pd.concat([df33, df11], 
                        join = 'inner', 
                        ignore_index = True)
row_concat33[:3]

     A    C
0   a1   b8
1   a3   b9
2  a10  b10

In [50]:
df11

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [51]:
df33

     A    C    F    H
0   a1   b8   c8   d8
1   a3   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [52]:
result = df11.merge(df33, on='A')

In [53]:
result

    A   B C_x   D C_y   F   H
0  a1  b1  c1  d1  b8  c8  d8
1  a3  b3  c3  d3  b9  c9  d9